<?php

/** @var yii\web\View $this */

$this->title = 'Главная';
?>
<div class="site-index">

    <div class="jumbotron text-center bg-transparent mt-5 mb-5">
        <h1 class="display-4">Привет!</h1>

        <p class="lead">Это мой первый проект на Yii2.</p>

    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-4 mb-3">
                <h2>Мой опыт</h2>

                <p>Ключевые компетенции: Разработка высоконагруженных бэкенд-систем на Laravel 9 (PHP 8.2) и CakePHP 5 (PHP 8.3) с соблюдением принципов MVC. Глубокая экспертиза в интеграции со сторонними API (банки, платежные системы), включая безопасное подключение и использование CryptoPro CSP на сервере для подписи XML-запросов. Опыт создания API для мобильных приложений, разработки Telegram ботов (включая низкоуровневую реализацию без библиотек) и Telegram Gateway. Навыки написания сложных SQL-запросов, базового фронтенда на jQuery и эффективной поддержки и модернизации legacy-кода.</p>

                <p><a class="btn btn-outline-secondary" href="https://hh.ru/resume/035c6524ff09bf53730039ed1f777835376e39?from=share_ios" target="_blank">Резюме &raquo;</a></p>
            </div>
            <div class="col-lg-4 mb-3">
                <h2>Мои хобби</h2>

                <p>Технические хобби и социальная активность: Увлеченно занимаюсь робототехникой, разрабатывая проекты на базе Arduino (C++) и Raspberry Pi, а также реализую алгоритмы компьютерного зрения и серверные решения с использованием Python (OpenCV, FastAPI). Активно передаю знания: преподаю программирование (Arduino, Python) и менторю детские робототехнические команды, помогая реализовывать их проекты и стартапы от идеи до прототипа.</p>

                <p><a class="btn btn-outline-secondary" href="https://maker-lab.ru" target="_blank">MakerLab &raquo;</a></p>
            </div>
            <div class="col-lg-4">
                <h2>Профессиональные Качества</h2>

                <p>Аналитическое мышление и решение задач: Глубокий анализ требований, поиск оптимальных технических решений для сложных задач (Backend, интеграции, робототехника).
                    Коммуникация и менторство: Эффективное объяснение сложных технических концепций (опыт преподавания Arduino/Python, менторство проектов).
                    Проактивность и самообучение: Постоянное освоение новых технологий (CakePHP 5, Python/CV, робототехнические платформы), инициативность в проектах.
                    Ориентация на результат и ответственность: Доведение задач до конца (от legacy-кода до детских стартапов), соблюдение сроков.
                    Работа в команде и лидерство: Успешное руководство детскими командами, коллаборация в профессиональных проектах.</p>

                <p><a class="btn btn-outline-secondary" href="https://hh.ru/resume/035c6524ff09bf53730039ed1f777835376e39?from=share_ios" target="_blank">GitHub &raquo;</a></p>
            </div>
        </div>

    </div>
</div>